[
    {
        "title":"Banking & Financial Services Industry",
        "img":"/img/bank.jpg",
        "prag1":"Chase & Hunt Consultancy can cater to all your recruitment requirements in Banking & Financial Services Markets in UAE and other parts of the middle east. We serve the banking and financial services community, supporting banks, investment management companies, private equity, boutique fund raisers / advisors and hedge funds with top quality staff. ",
        "prag2":"Our expert consultants are trained in financial markets, so you only deal with people who understand both the financial services industry and the specific professions within which you have vacancies. We have an inside track on the best people in retail banking, investment management, corporate banking, treasury, investment banking, private equity and wealth management banking candidates as they come onto the market. We also have a advisory team of senior ex bankers and working professionals who help us source and screen selected candidates for specific recruitment mandates. You can choose Chase & Hunt Consultancy to fast track you recruitment requirements as this is one of the specialized areas where we have some og our best consultants.  Get in touch with us and find out how we give you access to the best banking and financial services professionals for your organization. "
    },{
        "title":"Real Estate & Property Management",
        "img":"/img/realstate.jpg",
        "prag1":"Chase & Hunt Consultancy understands your recruitment needs in the real estate sector and can be your effective partner in sourcing and recruiting the best talent required for this competitive and ever changing sector. This dynamic sector has undergone several changes in the last few years and we have kept pace with the developments and the needs of the market.",
        "prag2":"We have a large database of real estate professionals for various roles and our consultants are also adept in headhunting and indentifying the talent pool from diverse sources. We can help you with all levels and roles for your industry and make sure you have access to the human capital that you require. We also under consists of an expert team of real estate recruiters servicing the Property and Real Estate markets across the GCC and Middle East. We recruit for a broad range of jobs that include --- Development, --- Asset Management --- Valuation and --- Research -Leasing/ Brokerage If you are looking for property jobs in Dubai or any part of the UAE or the Middle East, make Chase&Huntyour first point of contact."

    }
    ,
    {
        "title":"Executive & Senior Management",
        "img":"/img/manager.jpg",
        "prag1":"Chase & Hunt Consultancy has a senior team which can take care of your executive recruitments covering the  finance sector, general management, strategic, policy and project management. With our professional know-how, we can help you achieve lasting impact by bringing the right person to your organization. Our extensive middle management and executive database, local market knowledge and accurate response allow us to identify talented senior management and professionals for the right roles.",
        "prag2":"We manage the senior management recruitment mandates with discretion and sound judgment for a better fitment and section of the right candidates. We use headhunting a selective recruitment methodologies to access the candidates who best fit the given role.Please contact us with your requirements and we will be happy to discuss in confidence how we could help you find your next executive. "

    },
    {
        "title":"Engineering & Manufacturing",
        "img":"/img/engineer.jpg",
        "prag1":"Our consultants have a strong recruiting expertise and an in-depth knowledge of the engineering jobs market. Chase & Hunt Consultancy consultants are adept in recruiting engineering and manufacturing staff, filling even the most challenging civil engineering, mechanical, electrical, marine and structural engineering vacancies.",
        "prag2":"We also recruit manufacturing professionals for research, design and production management roles within the manufacturing industry. Our consultants can work within a particular market sector, such as FMCG, food and beverage, automotive, chemical, medical device and consumer industrial products, and they will take the time to understand your organisation’s specific challenges and opportunities. Whether you have a challenging appointment to fill or multiple vacancy requirements, find out more about why you should choose Chase & Hunt Consultancy your recruiting partner in Dubai, middle east or any other part of the world by getting in touch with us with your requirements."

        

    }
    ,
    {
        "title":"Office Support and Administration",
        "img":"/img/admin.jpg",
        "prag1":"We appreciate that the smooth running of your organisation depends upon the quality of your office administration staff. We can help you by sourcing first-rate admin professionals and customer services staff into a wide range of vacancies using our knowledge of their local markets and innovative recruitment methods for such recruitments.",
        "prag2":"We can access to local talent spanning across all levels of seniority, from purchasing administrators to office managers. By taking the time to really understand the qualities you are seeking in your next employee, we identify the right individuals to help your business and add real value to your team.Whether you have a challenging appointment to fill or multiple vacancy requirements, find out more about why you should choose Chase & Hunt Consultancy by contacting us with your recruitment requirements and let us be your partner."
        

    }
    ,
    {
        "title":"IT & E Commerce",
        "img":"/img/ecom.jpg",
        "prag1":"Chase & Hunt Consultancy can be your recruiter of choice for IT employers in the region. We can cater to your recruitment requirements in all main areas of IT and technical recruitment, from small-scale contingency through to large-scale campaign and recruitment management solutions.",
        "prag2":"We deliver our recruitment and workforce-related solutions through our niche teams covering various areas like including digital, development, ERP, finance technology, infrastructure, security and retail.  We aim to build networks of high-caliber candidates so our clients can access IT professionals with a diverse range of skill sets and from all levels of seniority and business sectors. Some of the specific recruitment mandates managed by our consultants are: --System administrators, --Database analysts, --Programmers, --Network architects, --Desktop support, --Project managers, ---Network administrators, --E- Commerce Specialists,--System Analysts If you are looking for candidates for IT jobs in Dubai or any part of the UAE or the Middle East, make Chase & Hunt Consultancy your first point of contact for your recruitment needs."

    }
    ,
    {
        "title":"Retail",
        "img":"/img/retail.jpg",
        "prag1":"Chase & Hunt Consultancy understands that the effectiveness of your retail oriented organization depends upon the professionals that you hire and our consultants understand the unique challenges of recruiting for the retail industry.",
        "prag2":"Whether you are looking for a store manager, merchandiser, operations director or garment technician, we will recommend the most effective methods to ensure your vacancy is filled with the right candidate in the shortest time frame.We have a wide range of experience in the retail industry and have successfully managed recruitment mandates of all levels and specialization. This valuable experience has given us the edge to understand the requirements and job roles in retail and also helped us to build a strong network with the talent pool in the market.You will find us to be a valuable and willing partner in supporting your recruitment needs and working seamlessly with your internal HR teams. We can also support your international bulk recruitment requirements as we have a strong associate network in countries like Nepal, Sri Lanka, India, South Africa and some countries in eastern Europe and south east Asia. Please get in touch with your requirements and let us partner with you in managing your human capital."
    }
    ,
    {
        "title":"",
        "img":"",
        "prag1":"",
        "prag2":""

    }
    ,
    {
        "title":"",
        "img":"",
        "prag1":"",
        "prag2":""

    }
    ,
    {
        "title":"",
        "img":"",
        "prag1":"",
        "prag2":""

    }
    ,
    {
        "title":"",
        "img":"",
        "prag1":"",
        "prag2":""

    }
    ,
    {
        "title":"",
        "img":"",
        "prag1":"",
        "prag2":""

    }
    ,
    {
        "title":"",
        "img":"",
        "prag1":"",
        "prag2":""

    }
    ,
    {
        "title":"",
        "img":"",
        "prag1":"",
        "prag2":""

    }
    ,
    {
        "title":"",
        "img":"",
        "prag1":"",
        "prag2":""

    }
    ,
    {
        "title":"",
        "img":"",
        "prag1":"",
        "prag2":""

    }
 
]